The  AnalysisDisplayColoredSurfaceSettings  type exposes the following members.
 Constructors
Name  |   Description
AnalysisDisplayColoredSurfaceSettings
 Constructs a default instance of colored surface settings.
AnalysisDisplayColoredSurfaceSettings(AnalysisDisplayColoredSurfaceSettings)
 Constructs a new copy of the input AnalysisDisplayColoredSurfaceSettings object.
 Methods
Name  |   Description
Dispose
 Releases all resources used by the  AnalysisDisplayColoredSurfaceSettings
Equals
 Determines whether the specified  Object  is equal to the current  Object  .
 (Inherited from  Object  .)
GetHashCode
 Serves as a hash function for a particular type.
 (Inherited from  Object  .)
GetType
 Gets the  Type  of the current instance.
 (Inherited from  Object  .)
IsEqual
 Compares two colored surface settings objects.
ToString
 Returns a string that represents the current object.
 (Inherited from  Object  .)
 Properties
Name  |   Description
GridColor
 Color of grid lines.
GridLineWeight
 Line weight of grid lines.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ShowContourLines
 If true, show contour lines in the analysis display.
ShowGridLines
 If true, show grid lines in the analysis display.
 See Also
  AnalysisDisplayColoredSurfaceSettings Class
  Autodesk.Revit.DB.Analysis Namespace